# математика B2 {0,1} - 0 False 1 True 
# Дизъюнкция (логическое сложение) - or
#  f(x,y) = x or y
# x y f(x,y)
# 0 0 0
# 0 1 1
# 1 0 1
# 1 1 1 

# Конъюнкция (логическое умножение) - and
#  f(x,y) = x and y
# x y f(x,y)
# 0 0 0
# 0 1 0
# 1 0 0
# 1 1 1
# Отрицание (логическое отрицание) - not
#  f(x) = not x
# x f(x)
# 0 1
# 1 0
# Импликация (логическое следование) - -> (<=)
#  f(x,y) = x -> y
# x y f(x,y)
# 0 0 1
# 0 1 1
# 1 0 0
# 1 1 1 
# Эквиваленция (логическая равносильность) - <=> (<->) (==)
#  f(x,y) = x <=> y
# x y f(x,y)
# 0 0 1
# 0 1 0
# 1 0 0
# 1 1 1
